LEXICON = {
    "forward": ">>",
    "backward": "<<",
    "/start_admin": (
        "Здравствуйте, администратор!"
    ),

    "/start_user": (
        "Чтобы пожаловаться о баге напишите 'Пожаловаться о баге', 'Проверить статус бага'. Так же эти кнопки есть в меню бота"
    ),
    "add_admin": "Добавить администратора",

    "bug_list": "список багов", 
    "accept": "Принимаю в работу",

    "report_bt": "Пожаловаться о баге",
    "status_bt": "Проверить статус бага",

    "confirm": "Подтверждаю",           # Кнопка пользователя для подтверждения исправления бага
    "not_confirm": "Не подтверждаю",    # Кнопка пользователя если баг не исправлен

    "details": "Подробнее",
    "new_bug": "Выявлен новый баг",

    "enter_description": "Опишите проблему.",
    "attach_report": "Прикрепите отчет (.docx или .txt).",
    "wrong_file_type": "Допустимы только .docx и .txt файлы.",
    "send_valid_file": "Пришлите файл формата .docx или .txt.",
    "bug_registered": "Ваше обращение зарегистрировано.",
    "no_bugs_user": "У вас пока нет зарегистрированных багов.",
    "no_bugs_admin": "У нас пока нет зарегистрированных багов.",
    "user_report": "Отчет пользователя",
    "bug_not_found": "Баг не найден",

    "remove_admin": "Удалить администратора",

    "select_admin": "Выбрать пользователя",
    "select_admin_for_remove": "Выбрать администратора",

    "admin_added": "Администратор успешно добавлен.",
    "admin_removed": "Администратор успешно удалён.",

    "already_admin": "Этот пользователь уже является администратором.",
    "not_admin": "Этот пользователь не является администратором.",

    "choose_user_for_admin": "Выберите пользователя для назначения администратором.",
    "choose_admin_for_remove": "Выберите администратора для удаления.",

    "status_new": "Новый",
    "status_in_progress": "В работе",
    "status_closed": "Исправлен",
    "status_reopened": "Возвращен",

    "bug_accepted": "Баг принят в работу",

    "description": "Описание",
    "severity": "Критичность",
    "status": "Статус",
    "report": "Отчёт",
    "user": "Пользователь",

    "report_file": "📄 Отчёт",
    "complete_fix": "✅ Завершить фикс",

    "fix_completed": "Пользователь уведомлён",

    "fix_completed_message":
        "Фикс бага завершён.\n\n"
        "Проверьте свою работу ещё раз и подтвердите, что всё работает.",

    "access_denied": "Этот баг назначен другому администратору",

    "status_waiting_confirmation":
        "Ожидает подтверждения пользователя",

    "thank_you": "Спасибо, что выбрали нашу систему",
    }
